SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( DP2-Early

Type ( Engine )
WagonShape ( DP2.s )
Size ( 3.10424m 4.53322m 20.9783m ) 
Mass ( 105t-uk )

Coupling (
		Type ( Chain )
		Spring (
        	Stiffness ( 1e6N/m 5e6N/m )
        	Damping ( 1e6N/m/s 1e6N/m/s )
		Break ( 600kN 1000kN )
        	r0 ( 20cm 30cm )
		    )
		comment( CouplingHasRigidConnection () )
		Velocity ( 0.1m/s )
	   )

BrakeEquipmentType ( Vacuum_brake, Auxilary_reservoir, Handbrake )
BrakeSystemType ( Vacuum_single_pipe )
MaxBrakeForce ( 422.474kN )    Comment (* brake force = 86% of locomotive weight *)
MaxHandbrakeForce ( 50kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )
BrakePipeVolume ( 1.61ft^3 )
ORTSNumberBrakeCylinders ( 2 ) Comment (* locomotive brake is straight air brake with vacuum brake for train *)
ORTSBrakeCylinderSize ( 24in )
MaxReleaseRate ( 10 )Comment (doesn't seem to do anything)
MaxApplicationRate ( 10 )Comment (doesn't seem to do anything)


Comment ( *********** Resistance ***** )	

ORTSBearingType ( Roller ) Comment (Roller bearings assumed)

Comment (these values match diagram of BR Test Report Docu PDF Graph 19 A=1650,B=25,C=3.5)Comment(CTN 1990 Resistance Medium Passenger Loco)
ORTSDavis_A ( 1265.0 )
ORTSDavis_B ( 35.1 )
ORTSDavis_C ( 3.24 )
ORTSWagonFrontalArea (104ft^2)
ORTSDavisDragConstant ( 0.0014 )

CentreOfGravity ( 0ft 8.0ft 0ft )
ORTSTrackGauge ( 4ft 8.5in )
ORTSRigidWheelbase ( 13ft 6.0in )
ORTSUnbalancedSuperelevation ( 6in )

Lights	(	13
		Light	(
			comment( Sphere of light )
			Type		( 1 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
                        TimeOfDay ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aa63635C )
					Position ( 0.0 3.5 18 )
					Transition ( 0 )
					Radius ( 150.0 )
					Angle ( 15.0 )
					)
				)
			)



		Light	(
			comment( Marker light left)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff9900 )
					Position ( -0.4500 2.4500 10.3000 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Marker light right)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff9900 )
					Position ( 0.4500 2.4500 10.3000 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Marker light Center left)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff9900 )
					Position ( -0.2250 2.4500 10.3000 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Marker light Center right)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff9900 )
					Position ( 0.2250 2.4500 10.3000 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)


            Light	(
			comment( rear Marker light left)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 60ff9900 )
					Position ( -0.4500 2.4500 -10.3000 )
					Azimuth ( 180 180 180  )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( rear Marker light right)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 60ff9900 )
					Position ( 0.4500 2.4500 -10.3000 )
					Azimuth ( 180 180 180  )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( rear Marker light Center left)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 60ff9900 )
					Position ( -0.2250 2.4500 -10.3000 )
					Azimuth ( 180 180 180  )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( rear Marker light Center right)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 60ff9900 )
					Position ( 0.2250 2.4500 -10.3000 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)



            Light	(
			comment( Rear red light left)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( -0.88000 1.7750 -10.3500 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Rear red light right)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0.88000 1.7750 -10.3500 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)		
		Light	(
			comment( Front red light left)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( -0.88000 1.7750 10.3500 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)
		Light	(
			comment( Front red light right)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0.88000 1.7750 10.3500 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.25 )
					)
				)
			)

		)
 
IntakePoint ( 0.0 0.4 FuelDiesel )
Sound ( "..\\..\\common.MEP\\MEP47-50Sound\\c50eng.sms" )
)


Engine ( DP2-Early

Effects
	(
		DieselSpecialEffects
		(
			
				Exhaust1
				(
					0.6500 3.9500 -1.6000
					0.35 1 0
					0.25
				)
				Exhaust2
				(
					-0.5500 3.9500 2.6000
					-0.35 1 0
					0.25
			)
		)
	)


Wagon ( DP2-Early )
Comment ( *** General Information *** )
WheelRadius ( 21.5in )
Sanding ( 25mph )
NumWheels ( 6 )
ORTSDriveWheelWeight ( 105t-uk )
MaxSteamHeatingPressure( 80psi )

Comment ( *** Diesel Prime Mover (Engine) *** )
Type ( Diesel )
ORTSDieselEngineMaxPower ( 2700hp )
MaxDieselLevel( 900g-uk )
MaxTemperature ( 120degF )
MaxOilPressure ( 90 )
DieselUsedPerHourAtMaxPower ( 69g-uk )
DieselUsedPerHourAtIdle ( 20g-uk )
DieselEngineIdleRPM( 450 )
DieselEngineMaxRPM( 850 )
DieselEngineMaxRPMChangeRate( 40 )

Comment ( *** Diesel Engine - Exhaust Effects *** )
DieselSmokeEffectInitialMagnitude( 1.7 )
DieselSmokeEffectMaxMagnitude( 2.2 )
DieselSmokeEffectInitialSmokeRate( 0.25 )
DieselSmokeEffectMaxSmokeRate( 10 )

Comment ( *** Traction Motor *** )
MaxPower ( 2160hp )
MaxForce ( 48500lb )
MaxContinuousForce ( 26795lb )
ORTSSpeedOfMaxContinuousForce ( 16.7mph )
MaxVelocity ( 90mph )
MaxCurrent ( 2700A )

Comment (*** Braking system ***)
BrakesEngineBrakeType( Vacuum_single_pipe ) Comment (* Engine brake is straight air brake *)
BrakesTrainBrakeType( Vacuum_single_pipe )
BrakeCutsPowerAtBrakeCylinderPressure( 12inHg )
   	  
ORTSBrakeServiceTimeFactor ( 10s )
ORTSBrakeEmergencyTimeFactor ( 5s ) 

Comment (*** Exhausters ***)
Comment (* Electrical exhausters - creating rate 220 cfm // estimate maintaining rate equivalent to 40 cfm @ train pipe *)
ORTSBrakePipeChargingRate ( 0.55InHg/s ) Comment (* creating rate for RELEASE only *)
Comment (* ORTSBrakePipeChargingRate = 0.11 for RUNNING/SERVICE - maintaining rate *)

Comment (*** Brake Valve Combined ***)
TrainBrakesControllerMaxSystemPressure ( 21 )
TrainBrakesControllerMinPressureReduction ( 2inHg )
EngineBrakesControllerHasProportionalBrake ( 1 )
EngineBrakesProportionalBrakeLag ( 0.5 ) Comment (* Loco air brake controlled by train pipe vacuum *)


EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 1 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)

VigilanceMonitor( 
        MonitoringDeviceTriggerOnOverRPM ( 1200 )
        MonitoringDeviceCriticalLevel( 1450 )            
        MonitoringDeviceTriggerOnHighCurrent ( 2150 )
        MonitoringDevicePenaltyTimeLimit( 0 )
        MonitoringDeviceAppliesCutsPower( 1 )
        MonitoringDeviceAppliesShutsDownEngine( 1 )
        MonitoringDeviceResetOnResetButton( 1 )
        MonitoringDeviceResetOnEngineAtIdle ( 1 )		
        MonitoringDeviceResetLevel( 0 )
        MonitoringDeviceAppliesBrake( 0 )
        MonitoringDeviceAppliesEmergencyBrake( 0 )		
            )
		
		
OverspeedMonitor(
        MonitoringDeviceMonitorTimeLimit( 0 )
        MonitoringDeviceAlarmTimeLimit( 0 )
        MonitoringDevicePenaltyTimeLimit( 0 )
        MonitoringDeviceCriticalLevel( 100 )
        MonitoringDeviceResetLevel( 0.1 )
        MonitoringDeviceAppliesFullBrake( 1 )
        MonitoringDeviceAppliesEmergencyBrake( 0 )
        MonitoringDeviceAppliesCutsPower( 1 )
        MonitoringDeviceAppliesShutsDownEngine( 1 )
        MonitoringDeviceAlarmTimeBeforeOverSpeed( 5 )
        MonitoringDeviceDoesSuppressionReset( 1 )
        MonitoringDeviceTriggerOnOverspeed( 95 )
        MonitoringDeviceResetOnZeroSpeed( 0 )
        MonitoringDeviceResetOnResetButton( 1 )
		)

EngineControllers (

Comment ( This locomotive fitted with 8 notch controller - Notch 0 = Idle )
      Throttle ( 0 1 0.125 0
          NumNotches ( 9
            Notch ( 0      0 Dummy )
            Notch ( 0.125  0 Dummy )
            Notch ( 0.25   0 Dummy )
            Notch ( 0.375  0 Dummy )
            Notch ( 0.5    0 Dummy )
            Notch ( 0.625  0 Dummy )
            Notch ( 0.75   0 Dummy )
            Notch ( 0.875  0 Dummy )
            Notch ( 1      0 Dummy )
          )
        )
       
Brake_Train ( 0 1 0.05 0.2
NumNotches ( 3
Notch ( 0.1 0 TrainBrakesControllerReleaseStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart )
Notch ( 0.9 0 TrainBrakesControllerEmergencyStart )
)
)
ORTSFastVacuumExhauster ( 0 1 0 )
ORTSSteamHeat( 0 1 0.0125 1 )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
        )

ORTSExternalSoundPassedThroughPercent ( 50 )          
Sound ( "..\\..\\common.MEP\\MEP47-50Sound\\c50cab.sms" )
CabView ( "MEPdelticVacC.cvf" )
HeadOut (  -1.5 3.0 9.0 )
Name ( "DP2 Early 1962 Livery, Semi-Basic Physics" )

Description (
	"Type4 Co-Co Prototype diesel-electric locomotive\n\n"+
	"Built by English Electric 1961\n\n"+
	"Number: DP2.In 1962 livery\n\n"+
	"Locomotive type: Diesel-Electric\n\n"+
	"Power source: Diesel engine English Electric 16CSCT 16cyl\n\n"+
	"Power: 2,700 hp @ 850rpm \n\n"+
	"Power at Rail: 2160 hp \n\n"+
	"Maximum speed: 90 mph \n\n"+
	"Route Availability: 5 \n\n"+
	"Brake Force: 51ton, Type: Vacuum/Air\n\n"+
	"Generator (rectified output): English Electric EE850/4B\n\n"+
	"Traction motors: Six English Electric EE538/5A, series wound, axle-hung\n\n"+
	"Maximum tractive effort: 48,500lbf \n\n"+
	"Continuous tractive effort: 30,000 lbf @ 32.5mph\n\n"+
	"Wheel configuration: Twelve 42-in tapered tread in two 6 wheel bogies\n\n"+
	"Weight: 110 metric tons \n\n"+
	"Height: 12ft 10in (3.95 m)\n\n"+
	"Length: 69ft 6in (21.20 m)\n\n"+
	"Width: 8ft 9.5in (2.69 m)"

 	)
	EngineOperatingProcedures (
      "To move forward\n"+
      "1.	Press the W key to move the Reverser to Forward.\n"+
      "2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
      "3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
      "4.	Press the D key to move the throttle from Idle to Notch 1.\n"+  
      "5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
      "To slow the train\n"+
      "1.	Press the A key to move the throttle to a lower setting.\n"+
      "2.	Use the brakes to further reduce speed if desired.\n\n"+  
      "To apply the dynamic brakes\n"+
      "1.	Press the A key to move the throttle to the Idle position.\n"+
      "2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position.  After allowing a few seconds for braking circuit setup, press the .     [PERIOD] key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
      "To release the dynamic brakes\n"+
      "1.	Press the D key to move the throttle towards Idle.\n\n"+
      "To apply the train brakes\n"+
      "1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
      "To bail off the train brakes on the locomotive\n"+
      "1. Press the / (FORWARD SLASH) key.\n\n"+
      "To release the train brakes\n"+
      "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
      "To apply the locomotive brake\n"+
      "1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
      "To release the locomotive brake\n"+
      "1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
      "To activate emergency braking\n"+
      "1.	Press the A key to reduce the throttle to Idle.\n"+
      "2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
      "To back up\n"+
      "1.	Bring your train to a full stop.\n"+ 
      "2.	Press the S key to move the Reverser to the Reverse position.\n"+
      "4.	Release the brakes.\n"+
      "5.	Slowly advance the throttle lever (D key).\n\n"+
      "To couple to a car or locomotive\n"+
      "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
      "TIP: To use the Coupling view, press the 6 key.\n"+
      "2. Press F9 to open the Train Operations window.\n"+
      "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
      "4. Close the Train Operations window.\n\n"+
      "To uncouple from a car or locomotive\n"+
      "1. Press F9 to open the Train Operations window.\n"+
      "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
      "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
      "4. Close the Train Operations window."
      ) 

)

